In [2]:
#Write a function to add elements in a tuple
def add(tup):
    print("Sum of elements in tuple is",sum(list(tup)))
    
no = (1,2,3,4,5)    
add(no)

Sum of elements in tuple is 15

In [3]:
l1=[1,2,3,4,5]
l2=[6,7,8,9,10]
l3=(list(zip(l1,l2)))
l3.sort(key = lambda x: x[1])
print("according second element")
print(l3)
print("according first element")
l3.sort()
print(l3)

according second element
[(1, 6), (2, 7), (3, 8), (4, 9), (5, 10)]
according first element
[(1, 6), (2, 7), (3, 8), (4, 9), (5, 10)]

In [98]:
file = open("new12.txt",'r')
try:
    file.write("First line of file")
except :
    print("File not writable")

File not writable

In [99]:
import pandas as pd
import numpy as np

# crete a sample dataframe
data = pd.DataFrame({
    'age' :     [ 10, 22, 13, 21, 12, 11, 17],
    'section' : [ 'A', 'B', 'C', 'B', 'B', 'A', 'A'],
    'city' :    [ 'Gurgaon', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai'],
    'gender' :  [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'],
    'favourite_color' : [ 'red', np.NAN, 'yellow', np.NAN, 'black', 'green', 'red']
})

# view the data
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       B    Delhi      F             NaN
2   13       C   Mumbai      F          yellow
3   21       B    Delhi      M             NaN
4   12       B   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       A   Mumbai      F             red

In [125]:
#Qno- By importing required module create a dataframe.Display the dataframe {'Brand' : ['Maruti', 'Hyundai', 'Tata', 'Mahindra', 'Maruti', 'Hyundai', 'Renault', 'Tata', 'Maruti'], 'Year' : [2012, 2014, 2011, 2015, 2012,
#2016, 2014, 2018, 2019], 'Kms Driven' : [50000, 30000, 60000,
#25000, 10000, 46000,
#31000, 15000, 12000], 'City' : ['Gurgaon', 'Delhi', 'Mumbai',
#'Delhi', 'Mumbai', 'Delhi',
#'Mumbai','Chennai', 'Ghaziabad'], 'Mileage' : [28, 27, 25, 26, 28,
#29, 24, 21, 24]}"""

#*After creating perform the following set of questions:- 1.selecting cars with brand 'Maruti' and Mileage > 25 
#2.selecting range of rows from 2 to 5 3.updating values of Mileage if Year < 2015 4.selecting 0th, 2th, 4th, and 7th index rows 5.selecting rows from 1 to 4 and columns from 2 to 4
#*After creating perform the following set of questions:- 1.selecting cars with brand 'Maruti' and Mileage > 25
#2.selecting range of rows from 2 to 5 
#3.updating values of Mileage if Year < 2015 
#4.selecting 0th, 2th, 4th, and 7th index rows 
#5.selecting rows from 1 to 4 and columns from 2 to 4""""

import pandas as pd
import numpy as np

data = pd.DataFrame({'Brand' : ['Maruti', 'Hyundai', 'Tata', 'Mahindra', 'Maruti', 'Hyundai', 'Renault', 'Tata', 'Maruti'], 'Year' : [2012, 2014, 2011, 2015, 2012,2016, 2014, 2018, 2019], 'Kms Driven' : [50000, 30000, 60000,25000, 10000, 46000,31000, 15000, 12000], 'City' : ['Gurgaon', 'Delhi', 'Mumbai','Delhi', 'Mumbai', 'Delhi','Mumbai','Chennai', 'Ghaziabad'], 'Mileage' : [28, 27, 25, 26, 28,29, 24, 21, 24]})

data.loc[data["Mileage"] > 25]

      Brand  Year  Kms Driven     City  Mileage
0    Maruti  2012       50000  Gurgaon       28
1   Hyundai  2014       30000    Delhi       27
3  Mahindra  2015       25000    Delhi       26
4    Maruti  2012       10000   Mumbai       28
5   Hyundai  2016       46000    Delhi       29